<html>
<head>
<title>Directory Cache</title>
<link rel="stylesheet" type="text/css" href="filezilla.css">
</head>

<body>
<p class="PageCaption">Cache des R&eacute;pertoires</p>
<p class="MidCaption">Vue d'Ensemble</p>
<p class="bodyText">Le cache des r&eacute;pertoires de FileZilla est une fonction 
  tr&egrave;s puissante. Il stocke tous les r&eacute;pertoires que vous avez visit&eacute; 
  sur le serveur, de telle sorte que FileZilla n'aura pas &agrave; r&eacute;cup&eacute;rer 
  la liste du r&eacute;pertoire aupr&egrave;s du serveur la prochaine fois que 
  vous voudrez afficher le m&ecirc;me r&eacute;pertoire. C'est particuli&egrave;rement 
  utile lorsque vous parcourez un r&eacute;pertoire &agrave; structure complexe 
  sur le serveur.</p>
<p class="bodyText">Quand le cache de r&eacute;pertoires est activ&eacute;, il 
  est &eacute;galement possible de parcourir les r&eacute;pertoires d&eacute;j&agrave; 
  visit&eacute;s pendant le transferts des fichiers, de sorte que vous pouvez 
  mettre les fichiers en file d'attente pour t&eacute;l&eacute;chargement pendant 
  que le transfert est en cours.</p>
<p align="center" class="bodyText"><img border="0" src="dircache.png" width="597" height="405"><br>
</p>
<p align="left" class="bodyText">Les trois champs de texte de la page de la bo&icirc;te 
  de dialogue contr&ocirc;lent la dur&eacute;e pendant laquelle le r&eacute;pertoire restera 
  en cache. Quand cette dur&eacute;e est d&eacute;pass&eacute;e, le r&eacute;pertoire sera 
  purg&eacute; du cache.<br>
  Si vous r&eacute;glez cette valeur &agrave; un niveau trop &eacute;lev&eacute;, 
  vous ne pourrez pas constater de changement sur le serveur, comme les nouveaux 
  fichiers ou les fichiers modifi&eacute;s. <br>
  En outre, si ce r&eacute;glage est trop bas, le cache deviendra inutile du fait 
  que son contenu sera purg&eacute; trop t&ocirc;t et que vous ne pourrez pas 
  parcourir ce serveur pendant le transfert si vous avez d&eacute;sactiv&eacute; 
  <b><a href="filetransfer.htm#usemultiple">Utiliser les connexions multiples</a></b>.</p>
</body>
</html>