<html>
<head>
<title>File transfer settings</title>
<link rel="stylesheet" type="text/css" href="filezilla.css">
</head>
<body>
<p align="center" class="PageCaption">Configuration du transfert de fichiers</p>
<p class="MidCaption" align="left">Vue d'ensemble:</p>
<p class="bodyText" align="left">Dans la section de configuration du transfert 
  de fichiers et ses sous-sections, vous pouvez modifier le comportement de FileZilla 
  au cours du transfert de fichiers.</p>
<p class="bodyText" align="center"> <img border="0" src="filetransfer.png" width="597" height="405">
  <br>
  (Section transfert de fichiers de la bo&icirc;te de dialogue des Options de 
  FileZilla)</p>
<p class="SmallCaption" align="left">Conserver date/heure des fichiers re&ccedil;us 
  du serveur</p>
<p class="bodyText" align="left">Par d&eacute;faut, la date d'un nouveau fichier 
  correspond &agrave; sa date de cr&eacute;ation. Activez cette fonction si FileZilla 
  doit pr&eacute;server l'horodatage d'un fichier re&ccedil;u. Si cette case est 
  coch&eacute;e, le fichier re&ccedil;u a la m&ecirc;me date/heure que le fichier 
  sur le serveur.</p>
<p class="SmallCaption" align="left"><a name="usemultiple"></a><b>Utiliser des 
  connexions simultan&eacute;es pour transf&eacute;rer les fichiers</b></p>
<p class="bodyText" align="left">Cette fonction activ&eacute;e, FileZilla peut 
  transf&eacute;rer plusieurs fichiers en une seule fois et il est &eacute;galement 
  possible de parcourir les serveurs pendant le transfert des fichiers. Le champ 
  de texte en dessous pr&eacute;cise le nombre de fichiers pouvant &ecirc;tre 
  transf&eacute;r&eacute;s en m&ecirc;me temps.<br>
  Si <b>Utiliser des connexions simultan&eacute;es pour transf&eacute;rer les 
  fichiers </b>est activ&eacute;, FileZilla lance une nouvelle connexion pour 
  chaque transfert. D&eacute;sactivez cette fonction si vous vous connectez fr&eacute;quemment 
  aux serveurs qui ne permettent pas les connexions multiples et qui peuvent m&ecirc;me 
  vous interdire d'essayer d'&eacute;tablir des connexions multiples.</p>
<p class="SmallCaption" align="left">Options fichiers existants</p>
<p class="bodyText" align="left">Vous pouvez s&eacute;lectionner l'action de transfert 
  par d&eacute;faut vers la cible des fichiers qui existent d&eacute;j&agrave;. 
  Par d&eacute;faut, FileZilla vous demande &agrave; chaque fois la permission 
  de remplacer un fichier.</p>
<p class="MidCaption">Options suppl&eacute;mentaires</p>
<p class="bodyText">La section Transfert de Fichiers pr&eacute;sente plusieurs 
  sous-sections dans lesquelles vous pouvez configurer d'autres options de transfert:</p>
<ul>
  <li>
    <p class="bodyText"><b><a href="asciibinary.htm">ASCII/Binaire</a></b>
  </li>
  <li>
    <p class="bodyText"><b><a href="speedlimit.htm">Vitesse Limite</a></b>
  </li>
</ul>
</body>
</html>