<html>
<head>
<title>FileZilla history</title>
<link rel="stylesheet" type="text/css" href="filezilla.css">
</head>

<body>
<h1 align="center" class="PageCaption">L'Histoire de FileZilla</h1>

<p align="left" class="bodyText">Comme chef du projet, je suis tr&egrave;s fier 
  du succ&egrave;s de FileZilla. Depuis la premi&egrave;re version alpha de FileZilla, 
  r&eacute;alis&eacute;e fin f&eacute;vrier 2001, FileZilla est devenu tr&egrave;s 
  populaire. Il existe plus d'une centaine d'autres clients FTP pour Windows, 
  mais aucun d'entre eux n'a atteint un tel r&eacute;sultat en si peu de temps. 
  Il y a certainement des raisons au succ&egrave;s de FileZilla et je vais vous 
  les expliquer ci-dessous.</p>

<p class="bodyText">Au cours de la seconde semaine de janvier 2001, dans le classe 
  Computer Science, j'ai commenc&eacute; &agrave; &eacute;crire un client FTP 
  avec deux amis pendant que le reste de notre classe &eacute;crivait un clone 
  de &quot;4-in-a-row&quot;. Nous ne pensions pas que FileZilla aurait un tel 
  succ&egrave;s. Avant de commencer &agrave; coder, nous devions discuter de la 
  fa&ccedil;on dont FileZilla devrait &ecirc;tre r&eacute;alis&eacute;. Nous d&eacute;cid&acirc;mes 
  de cr&eacute;er FileZilla en projet open source. Il existait d&eacute;j&agrave; 
  beaucoup de clients FTP disponibles et nous ne pensions pas que nous en vendrions 
  un seul exemplaire si nous commercialisions FileZilla, et par cons&eacute;quent 
  l'open source &eacute;tait le meilleur choix.</p>

<p class="bodyText">Notre objectif principal pour FileZilla fut d'&eacute;crire 
  un client FTP simple, avec une interface utilisateur extr&ecirc;mement simple. 
  FileZilla devrait supporter toutes les fonctions de base n&eacute;cessaires 
  pour parcourir un serveur et transf&eacute;rer des fichiers. FileZilla devrait 
  aussi &ecirc;tre rapide et fiable. A chaque version, de nouvelles fonctions 
  &eacute;taient ajout&eacute;es &agrave; FileZilla. A partir de la version b&ecirc;ta 
  2.1, toutes les fonctions requises furent impl&eacute;ment&eacute;es &agrave; 
  FileZilla. Mais le d&eacute;veloppement ne s'est pas arr&ecirc;t&eacute; &agrave; 
  la version b&ecirc;ta 2.1. Avec l'aide et les id&eacute;es des autres utilisateurs 
  de FileZilla, j'ai continu&eacute; &agrave; am&eacute;liorer le programme. Les 
  bogues ont &eacute;t&eacute; supprim&eacute;s et de nouvelles fonctions ont 
  &eacute;t&eacute; ajout&eacute;es ou am&eacute;lior&eacute;es.</p>

<p class="bodyText">Depuis la premi&egrave;re version, FileZilla a &eacute;t&eacute; 
  le seul client FTP que j'ai utilis&eacute;, et je l'utilise encore chaque jour. 
  Si un programme est vraiment bien, il n'y a aucune raison d'en utiliser un autre.</p>

<p class="bodyText">Mais il existe une autre raison au succ&egrave;s de FileZilla. 
  Certains se sont demand&eacute;: &quot;Pourquoi fabrique t-il FileZilla? Il 
  ne gagne rien avec!&quot; En ce qui concerne l'aspect financier, c'est vrai, 
  mais si vous y regardez de plus pr&egrave;s, vous verrez ce que j'y gagne. Tout 
  d'abord, l'exp&eacute;rience, que je partage avec les autres par l'interm&eacute;diaire 
  du code source ouvert. De plus, beaucoup de gens me connaissent. Ce sont des 
  utilisateurs comme vous qui m'ont envoy&eacute; leurs id&eacute;es et probl&egrave;mes 
  avec FileZilla par messagerie. C'est le retour des choses, aussi bien positif 
  que - dans une moindre mesure - n&eacute;gatif, et qui est vital pour FileZilla 
  et moi. Cela me montre qu'il y a un int&eacute;r&ecirc;t public &agrave; mon 
  projet, ce qui me donne des id&eacute;es pour son am&eacute;lioration, et me 
  maintient occup&eacute;!<br>
<br>
  Vous comprendrez ce que je ressent si vous avez d&eacute;j&agrave; re&ccedil;u 
  des emails comme &quot;Super travail, continuez!&quot; ou &quot;Merci pour FileZilla! 
  Mais o&ugrave; faut-il que j'envoie la pizza?&quot;</p>

<p class="bodyText">Merci de votre patience,<br>

<a href="mailto:Tim.Kosse@gmx.de">

Tim Kosse<br>
  </a> Chef du projet FileZilla</p>
</body>
</html>