<html>

<head>
<title>Quick Guide</title>
<link rel="stylesheet" type="text/css" href="filezilla.css">
</head>

<body>
<p align="center" class="PageCaption"> Guide Rapide</p>
<p align="left" class="bodyText">Ce guide vous donne un aper&ccedil;u rapide sur 
  la fa&ccedil;on d'utiliser FileZilla. Par d&eacute;faut, vous n'avez pas &agrave; 
  configurer FileZilla, et vous pouvez donc commencer &agrave; travailler directement 
  avec le programme.</p>
<p align="left" class="SmallCaption">1. Connexion &agrave; un serveur FTP </p>
<p class="bodyText" align="left">Pour vous connecter &agrave; un serveur FTP, 
  entrez l'adresse du serveur dans la champ de texte <b>Adresse</b> de la barre 
  de Connexion Rapide.&nbsp;S'il s'agit d'un serveur particulier comme un serveur 
  SFTP, ajoutez le protocole au d&eacute;but de l'adresse. Dans le cas d'un serveur 
  SFTP, d&eacute;marrez l'adresse avec 'sftp://'. Entrez le port du serveur dans 
  la champ <b>Port</b> si &ccedil;a n'est pas un port par d&eacute;faut (21 pour 
  FTP, 22 pour SFTP). Si les <b>Nom d'utilisateur</b>/ <b>Mot de passe</b> sont 
  requis, entrez les dans le champ appropri&eacute;. Cliquez sur <b>Connexion 
  rapide</b> ou appuyez sur <b>Enter</b> pour vous connecter au serveur.</p>
<p class="bodyText" align="center"><img border="0" src="quickconnectbar.png" width="693" height="26"></p>

<p class="SmallCaption" align="left">2. Parcourir le serveur</p>
<p class="bodyText" align="left">Apr&egrave;s une tentative de connexion r&eacute;ussie, 
  une liste des fichiers et dossiers appara&icirc;t dans le cadre de droite de 
  la fen&ecirc;tre principale. Le dossier actuel est list&eacute; dans la champ 
  d'&eacute;dition du haut. Vous pouvez changer de dossier actuel en double-cliquant 
  sur un dossier ou en entrant le nom du dossier dans le champ et en appuyant 
  sur <i>Enter</i>. Vous pouvez aussi faire un clic droit sur un dossier de la 
  liste et s&eacute;lectionner <b>Ouvrir</b> dans le menu contextuel pour changer 
  de dossier actuel. Vous remarquerez un dossier &quot;<b>..</b>&quot; affich&eacute; 
  dans tous les cadres de r&eacute;pertoires. Ce dossier vous permet de remonter 
  au dossier parent du dossier actuel.</p>
<p class="bodyText" align="center"><img border="0" src="quick guide - fileview.png" width="421" height="121"></p>
<p class="bodyText" align="center">&nbsp;</p>
<p class="SmallCaption" align="left">3. Parcourir votre machine</p>
<p class="bodyText" align="left">Parcourir votre machine se fait de la m&ecirc;me 
  fa&ccedil;on que pour le serveur. Il n'y a qu'une seule diff&eacute;rence: les 
  dossiers de votre machine sont agenc&eacute;s sous forme d'une arborescence 
  pour un parcours plus rapide. Une arborescence est &eacute;galement disponible 
  pour le site distant, mais elle est cach&eacute;e par d&eacute;faut. L'arborescence 
  distante peut &ecirc;tre affich&eacute;e &agrave; tout moment en cliquant sur 
  l'ic&ocirc;ne d'arborescence distante <img border="0" src="toolbar_remotetreeview.png" width="20" height="20"> 
  de la barre d'outils.<br>
  Pour changer le dossier actuel, aussi bien sur votre machine que sur le serveur, 
  s&eacute;lectionnez simplement un &eacute;l&eacute;ment dans l'arborescence 
  appropri&eacute;s.</p>
<p class="bodyText" align="center"><img border="0" src="quick guide - local fileview.png" width="232" height="167"></p>

<p class="SmallCaption" align="left">4. Transf&eacute;rer des fichiers</p>
<p class="bodyText" align="left">Vous pouvez envoyer sur le serveur ou recevoir 
  un fichier en double-cliquant dessus. Il sera ajout&eacute; &agrave; la File 
  d'Attente de Transferts et le transfert d&eacute;marrera automatiquement. Pour 
  transf&eacute;rer des dossiers et/ou des fichiers multiples, s&eacute;lectionnez 
  les et faites un clic droit sur la s&eacute;lection. Vous pourrez alors cliquez 
  sur Charger sur le Serveur/T&eacute;l&eacute;charger dans le menu d&eacute;roulant.</p>
<p class="bodyText" align="center"><img border="0" src="quick guide - transfer.png" width="249" height="121"></p>
<p class="bodyText" align="left">Vous pouvez aussi faire glisser les fichiers 
  d'un cadre et les d&eacute;poser dans l'autre. Pour ajouter des fichiers &agrave; 
  la file d'attente pour qu'ils soient transf&eacute;r&eacute;s ult&eacute;rieurement, 
  s&eacute;lectionnez les et cliquez sur <b>Ajouter &agrave; la File d'Attente</b> 
  &agrave; partir du menu d&eacute;roulant. Vous pouvez aussi faire glisser ces 
  fichiers directement dans le cadre de la file d'attente. Cliquez sur le bouton 
  <img border="0" src="toolbar_transfer.png" width="20" height="20"> de la barre 
  d'outils pour lancer le transfert.</p>

</body>

</html>