<html>
<head>
<title>Remote file list</title>
<link rel="stylesheet" type="text/css" href="filezilla.css">
</head>
<body>
<p align="center" class="PageCaption">Liste des Fichiers Distants</p>

<p class="MidCaption" align="left">Vue d'ensemble:</p>

<p class="bodyText" align="left">Cette section configure l'apparence de la liste 
  des fichiers distants.</p>

<p class="bodyText" align="center"> <img border="0" src="remotefilelist.png" width="597" height="405">
  <br>
  (Section <i>Liste des fichiers distants</i> de la bo&icirc;te de dialogue des 
  Param&egrave;tres)</p>
<p class="SmallCaption" align="left"> <b>Toujours utiliser la configuration suivante</b></p>
<p class="bodyText" align="left"> Quand cette option est s&eacute;lectionn&eacute;e, 
  les &eacute;l&eacute;ments choisis pour l'affichage de la liste des fichiers 
  distants seront utilis&eacute;s.</p>
<blockquote>
  <p class="bodyText" align="left"> <b>Affichage par d&eacute;faut</b></p>
  <p class="bodyText" align="left"> Choisir l'un des types d'affichage de la liste 
    des fichiers distant dans le menu d&eacute;roulant:</p>
  <table border="0" cellpadding="0" cellspacing="0" style="border-collapse: collapse" bordercolor="#111111">
    <tr>
      <td nowrap class="SmallCaption">D&eacute;tails</td>
      <td nowrap class="bodyText" width="10" align="center">-</td>
      <td class="bodyText">Liste des fichiers pr&eacute;sentant tous les d&eacute;tails: 
        c'est le style par d&eacute;faut</td>
    </tr>
    <tr>
      <td nowrap class="SmallCaption">Liste</td>
      <td nowrap class="bodyText" width="10" align="center">-</td>
      <td class="bodyText">Liste des noms de fichiers et de leurs ic&ocirc;nes 
        seulement. Cette liste peut &ecirc;tre &eacute;tendue horizontalement 
        si elle est trop importante pour la taille de la fen&ecirc;tre</td>
    </tr>
    <tr>
      <td nowrap class="SmallCaption">Grandes ic&ocirc;nes</td>
      <td nowrap class="bodyText" width="10" align="center">-</td>
      <td class="bodyText">Liste sous forme d'ic&ocirc;nes avec le nom de fichier 
        dessous.</td>
    </tr>
    <tr>
      <td nowrap class="SmallCaption">Petites ic&ocirc;nes</td>
      <td nowrap class="bodyText" width="10" align="center">-</td>
      <td class="bodyText">Liste des noms de fichiers et de leurs ic&ocirc;nes 
        seulement. Cette liste peut &ecirc;tre &eacute;tendue verticalement si 
        elle est trop importante pour la taille de la fen&ecirc;tre</td>
    </tr>
  </table>

  <p class="bodyText" align="left"> <b>Colonnes visibles pour l'affichage d&eacute;taill&eacute;</b></p>



  <p class="bodyText" align="left"> Sp&eacute;cifie quelles colonnes seront visibles 
    avec le style 'D&eacute;taill&eacute;'. Utile si vous ne souhaitez pas afficher 
    tous les d&eacute;tails.</p>



</blockquote>

<p class="SmallCaption" align="left"> <b>Se souvenir de la derni&egrave;re configuration 
  utilis&eacute;e </b></p>



<p class="bodyText" align="left">Si cette option est s&eacute;lectionn&eacute;e, 
  FileZilla m&eacute;morisera l'agencement de la liste des fichiers distants &agrave; 
  la fermeture et le restituera &agrave; la prochaine session.</p>
<p class="SmallCaption">M&eacute;moriser la largeur des colonnes dans l'affichage 
  d&eacute;taill&eacute;</p>
<p class="bodyText">Si cette option est activ&eacute;e, FileZilla m&eacute;morisera 
  la largeur des colonnes pour l'affichage de la liste des fichiers distants pour 
  le style 'D&eacute;taill&eacute;'.</p>
<p class="SmallCaption">Format de la taille des fichiers dans le style 'D&eacute;taill&eacute;'</p>
<p class="bodyText">Sp&eacute;cifie sous quel format la taille de fichiers sera 
  affich&eacute;e. La taille peut aussi bien &ecirc;tre affich&eacute;e en bytes, 
  KB et MB. Avec le mode <b>Auto</b>, FileZilla tient compte de la taille de fichier 
  pour s'adapter au plus petit affichage: un gros fichier pouvant entra&icirc;ner 
  une grande cha&icirc;ne &agrave; afficher, FileZilla utilisera les KB ou MB 
  dans ce cas.</p>
<p class="SmallCaption">Toujours montrer les fichiers cach&eacute;s</p>



<p class="bodyText">Par d&eacute;faut, certains serveurs n'affichent pas les fichiers 
  cach&eacute;s comme les fichiers dot (noms de fichiers commen&ccedil;ant par 
  un point). Activez <b>Toujours montrer les fichiers cach&eacute;s</b> si vous 
  voulez voir ces fichiers. Cependant, tous les serveurs ne supportent pas cette 
  fonction, et peuvent retourner une erreur ou des listes de dossiers distants 
  rompus ou incomplets. Soyez donc prudent en activant cette fonction.</p>
</body>
</html>